# This Brewfile is used to install all the necessary packages, tools and apps

# You can generate a Brewfile using the command:
#   brew bundle dump
# You can install all the packages listed in the Brewfile using the command:
#   brew bundle --file Brewfile

# Taps need to be trusted. Read https://docs.brew.sh/Tap-Trust

tap "ngrok/ngrok", trusted: true

brew "awscli"  # Official Amazon AWS command-line interface
brew "bat"  # Clone of cat(1) with syntax highlighting and Git integration
brew "gh"  # GitHub command-line tool
brew "git-delta"  # Syntax-highlighting pager for git and diff output
brew "mas"  # Mac App Store command line interface
brew "mkcert"  # Simple tool to make locally trusted development certificates
brew "nvm"  # Manage multiple Node.js versions
brew "pipx"  # Install and run Python applications in isolated environments, e.g. poetry
brew "pkgconf"  # Package compiler and linker metadata toolkit
brew "pnpm"  # Fast, disk space efficient package manager for Node.js
brew "postgresql@15"
brew "pyenv"  # Python version management
brew "ripgrep"  # Search tool similar to grep, but faster
brew "ruby"
brew "tox"  # Generic Python virtualenv management and test command-line tool
brew "tree"

cask "android-studio"
cask "appcleaner"
cask "canva"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "discord"
cask "docker-desktop"
cask "expressvpn"
cask "google-drive"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "ngrok"
cask "postman"
cask "slack"
cask "spotify"
cask "telegram-desktop"
cask "todoist-app"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

mas "Magnet", id: 441258766
